AccumulationRegisters/РасчетыНДФЛАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыНДФЛАУСН</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВычета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеоблагаемаяВзносами</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДФЛ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДФЛУдержаный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДФЛПеречисленный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДФЛНерезидента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерУведомленияНерезидента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУведомленияНерезидента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНалоговогоОрганаНерезидента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправитьВБанк</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ведомость</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВедомостьНаВыплатуЗарплатыВБанк</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговыйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодДохода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодВычета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодНеоблагаемогоВзносамиДохода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

AccumulationRegisters/РазметкаАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РазметкаАУСН</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиРазметкиАУСН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскаяОперация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПризнакНалоговойБазы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиНалоговойБазыАУСН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииОперацийАУСН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыПоНалогамНаЕдиномНалоговомСчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоНалогамНаЕдиномНалоговомСчете</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОбИсчисленныхСуммахНалогов</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоЕдиномуНалоговомуСчету</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Налог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНалоговИПлатежейВБюджет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокУплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonModules/УчетАУСН/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает сумму доходов организации на АУСН за выбранный период.
// Учитываются только доходы, полученные по банку и по кассе. Доходы по кассе определяются по данным бухгалтерского учета.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации
//  НачалоПериода - Дата - начало периода
//  КонецПериода - Дата - конец периода
// 
// Возвращаемое значение:
//  Число - сумма доходов за период
//
Функция СуммаДоходов(Организация, НачалоПериода, КонецПериода) Экспорт
	
	Если Не УчетнаяПолитика.ПрименяетсяАУСН(Организация, КонецПериода) Тогда
		Возврат 0;
	КонецЕсли;
	
	СуммаДоходов = СуммаДоходовПоБанковскимОперациям(Организация, НачалоПериода, КонецПериода)
		+ СуммаДоходовПоКассовымОперациям(Организация, НачалоПериода, КонецПериода);
	
	Возврат СуммаДоходов;
	
КонецФункции

// Возвращает лимит доходов налогоплательщика, ограничивающий его право на применение Автоматизированной УСН
// Автоматизированная УСН
// 
// Возвращаемое значение:
//  Число 
//
Функция ГраницаДоходов() Экспорт
	
	Возврат 60000000;

КонецФункции

// Возвращает лимит средней численности работников
//
// Возвращаемое значение:
//  Число - Граница среднесписочной численности работников, ограничивающая право применения Автоматизированной УСН 
//
Функция ГраницаЧисленностиРаботников() Экспорт
	
	Возврат 5;
	
КонецФункции

// Возвращает лимит остаточной стоимости основных средств налогоплательщика,
// ограничивающий его право на применение Автоматизированной УСН
// 
// Возвращаемое значение:
//  Число - Лимит остаточной стоимости основных средств 
//
Функция ГраницаСтоимостиОсновныхСредств() Экспорт

	Возврат 150000000;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПодготовитьТаблицуРасчетНДФЛ(ТаблицаПеречислениеЗарплаты, ОплатаПоДоговорамПодряда, ТаблицаРеквизитов) Экспорт
	
	Возврат УчетЗарплаты.ДанныеРасчетаНДФЛАУСН(ТаблицаПеречислениеЗарплаты, ОплатаПоДоговорамПодряда, ТаблицаРеквизитов);

КонецФункции

Процедура СформироватьДвиженияНДФЛ(РеквизитыРасчетаНДФЛАУСН, ТаблицаРасчетаНДФЛАУСН, Движения) Экспорт 
	
	Если Не ЗначениеЗаполнено(РеквизитыРасчетаНДФЛАУСН)
		Или Не ЗначениеЗаполнено(ТаблицаРасчетаНДФЛАУСН) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = ПодготовитьПараметрыДвиженияНДФЛАУСН(РеквизитыРасчетаНДФЛАУСН, ТаблицаРасчетаНДФЛАУСН);
	Реквизиты = Параметры.Реквизиты[0];
	
	Для Каждого ЗаписьНДФЛАУСН Из Параметры.РасчетыНДФЛАУСН Цикл
		
		Движение = Движения.РасчетыНДФЛАУСН.Добавить();
		
		ЗаполнитьЗначенияСвойств(Движение, Реквизиты);
		ЗаполнитьЗначенияСвойств(Движение, ЗаписьНДФЛАУСН);
		
	КонецЦикла;
	
	Движения.РасчетыНДФЛАУСН.Записывать = Истина;

КонецПроцедуры 

Функция ПодготовитьПараметрыДвиженияНДФЛАУСН(ТаблицаРеквизиты, РасчетыНДФЛАУСН)

	Параметры = Новый Структура;

	// Подготовка таблицы Параметры.Реквизиты.
	
	СписокОбязательныхКолонок = ""
	+ "Период,"                   // <Дата> - период движений - дата документа
	+ "Организация,"              // <СправочникСсылка.Организации>
	+ "Регистратор";              // <ДокументСсылка>
	
	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизиты, СписокОбязательныхКолонок));
		
	// Подготовка таблицы Параметры.РасчетыНДФЛАУСН.
	СписокОбязательныхКолонок = ""
	+ "Ведомость,"                      // <ДокументСсылка.ВедомостьНаВыплатуЗарплатыВБанк>
	+ "ФизическоеЛицо,"                 // <СправочникСсылка.ФизическиеЛица>
	+ "НалоговыйПериод,"                // <Дата>
	+ "КодДохода,"                      // <Строка, 4>
	+ "КодВычета,"                      // <Строка, 3>
	+ "КодНеоблагаемогоВзносамиДохода," // <Строка, 2>
	+ "НомерУведомленияНерезидента,"    // <Строка, 20>
	+ "ДатаУведомленияНерезидента,"     // <Дата>
	+ "КодНалоговогоОрганаНерезидента," // <Строка, 4>
	+ "СуммаДохода,"                    // <ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака>
	+ "СуммаВычета,"                    // <ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака>
	+ "СуммаНеоблагаемаяВзносами,"      // <ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака>
	+ "СуммаНДФЛ,"                      // <ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака>
	+ "СуммаНДФЛУдержаный,"             // <ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака>
	+ "СуммаНДФЛПеречисленный,"         // <ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака>
	+ "НДФЛНерезидента"                 // <ОпределяемыйТип.ДенежнаяСуммаЛюбогоЗнака>
	;
	Параметры.Вставить("РасчетыНДФЛАУСН", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(РасчетыНДФЛАУСН,
																		СписокОбязательныхКолонок));

	Возврат Параметры;

КонецФункции

// Обработчик события ПриСозданииНаСервере формы универсального отчета (общей формы ФормаОтчета).
// Если запускается вариант "ВыплатыПриИспользованииАУСН" в контексте списка задач,
// добавляет на форму баннер с пояснениями.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма отчета
//  Отказ - Булево - признак отказа от выполнения обработчика
//  СтандартнаяОбработка - Булево - признак отказа от стандартной обработки события
//
Процедура ФормаОтчетаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Форма.КлючТекущегоВарианта <> "ВыплатыПриИспользованииАУСН" Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Форма.Параметры;
	
	ВызовИзСпискаЗадач = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыФормы, "ВызовИзСпискаЗадач", Ложь);
	СвойстваЗадачи = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыФормы, "СвойстваЗадачи", Новый Структура);
	
	Срок = Неопределено;
	
	Если Не ВызовИзСпискаЗадач Или Не СвойстваЗадачи.Свойство("Срок", Срок) Или (СвойстваЗадачи.Свойство("Организация")
		И РегистрыСведений.СостоянияИнтеграцииАУСН.МожемПередатьНДФЛИзПрограммы(СвойстваЗадачи.Организация)) Тогда
		Возврат;
	КонецЕсли;
	
	РазместитьИнформациюОЗадачеСведенияПоСотрудникам(Форма, Срок);
	
КонецПроцедуры

// Описывает контекст, в котором выполняется начисление налога АУСН - организацию, период и т.п.
//
// Параметры:
//  Организация      - СправочникСсылка.Организации - налогоплательщик.
//  ПериодРасчета    - Дата - месяц, за который начисляется налог.
//
// Возвращаемое значение:
//  Структура    - состав см. в теле функции
//  Неопределено - начисление не имеет смысла: в указанный период организация еще не зарегистрирована, или не применяет АУСН
//
Функция НовыйКонтекстРасчетаНалога(Организация, ПериодРасчета) Экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НачалоНалоговогоПериода = НачалоМесяца(ПериодРасчета);
	КонецНалоговогоПериода = КонецМесяца(ПериодРасчета);
	
	ПрименяетсяАУСН = УчетнаяПолитика.ПрименяетсяАУСН(Организация, НачалоНалоговогоПериода);
	Если Не ПрименяетсяАУСН Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КонтекстРасчета = Новый Структура;
	
	КонтекстРасчета.Вставить("Организация",             Организация);
	КонтекстРасчета.Вставить("Период",                  ПериодРасчета);
	КонтекстРасчета.Вставить("ПрименяетсяАУСН",         ПрименяетсяАУСН);
	КонтекстРасчета.Вставить("НачалоНалоговогоПериода", НачалоНалоговогоПериода);
	КонтекстРасчета.Вставить("КонецНалоговогоПериода",  КонецНалоговогоПериода);
	
	Возврат КонтекстРасчета;
	
КонецФункции

// Возвращает данные для отражения уплаченного налога АУСН в проводках.
//
// Параметры:
//  КонтекстРасчета      - Структура - контекст, в котором выполняется расчет (организация, период и т.п.),
//                                     см. НовыйКонтекстРасчета().
//
// Возвращаемое значение:
//  Структура    - содержит таблицы для отражения начисленного налога в бухучете и для формирования справки-расчета:
//                  * ТаблицаПроводок       - см. НалоговыйУчет.НоваяТаблицаНачисленияНалога()
//                  * ТаблицаСправкиРасчета - см. НоваяТаблицаСправкиРасчетаНалога()
//                  * Ошибки - Массив из Структура - массив ошибок.
//
Функция ПодготовитьРасчетНалога(КонтекстРасчета) Экспорт
	
	ТаблицаПроводок = НалоговыйУчет.НоваяТаблицаНачисленияНалога();
	Ошибки = Новый Массив;
	
	Если КонтекстРасчета.ПрименяетсяАУСН Тогда
		НачислитьНалогАУСН(КонтекстРасчета, ТаблицаПроводок, Ошибки);
	КонецЕсли;
	
	РезультатРасчета = Новый Структура();
	РезультатРасчета.Вставить("ТаблицаПроводок", ТаблицаПроводок);
	РезультатРасчета.Вставить("Ошибки", Ошибки);
	
	Возврат РезультатРасчета;
	
КонецФункции

// Процедура - Формирует движения начисления налога АУСН
//
// Параметры:
//  ТаблицаПроводок   - Таблица значений -   содерижт данные для формирования проводок,
//                                           см. НалоговыйУчет.НоваяТаблицаНачисленияНалога
//  ТаблицаРеквизитов - Таблица значений -   содержит реквизиты организации
//                                           см. РегламентнаяОперация.ПодготовитьПараметрыНачисленияНалогаАУСН
//  Движения          - Коллекция движений - движения документа Регламентная операция
//  Отказ             - Булево -             признак прерывания процедуры
//
Процедура СформироватьДвиженияНачислениеНалогаАУСН(ТаблицаПроводок, ТаблицаРеквизитов, Движения, Отказ) Экспорт

	Если Не ЗначениеЗаполнено(ТаблицаРеквизитов) Тогда
		Возврат;
	КонецЕсли;

	Параметры = ПодготовитьПараметрыНачисленияНалогаАУСН(ТаблицаПроводок, ТаблицаРеквизитов);
	Реквизиты = Параметры.Реквизиты[0];
	
	// Проводка по начислению налога.
	Для Каждого СтрокаПроводки Из Параметры.Проводки Цикл
	
		Проводка = Движения.Хозрасчетный.Добавить();
		
		ЗаполнитьЗначенияСвойств(Проводка, Реквизиты);
		ЗаполнитьЗначенияСвойств(Проводка, СтрокаПроводки);
		
		НалоговыйУчет.УстановитьСубконтоСчетаПоНачислениюНалога(СтрокаПроводки, Проводка.СчетДт, Проводка.СубконтоДт);
		НалоговыйУчет.УстановитьСубконтоСчетаПоНачислениюНалога(СтрокаПроводки, Проводка.СчетКт, Проводка.СубконтоКт);
		
		Движения.Хозрасчетный.Записывать = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СуммаДоходовПоБанковскимОперациям(Организация, НачалоПериода, КонецПериода)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Приход", Перечисления.ПризнакиНалоговойБазыАУСН.Приход);
	Запрос.УстановитьПараметр("ВозвратПрихода", Перечисления.ПризнакиНалоговойБазыАУСН.ВозвратПрихода);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВложенныйЗапрос.Сумма), 0) КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		РазметкаАУСНОбороты.СуммаОборот КАК Сумма
	|	ИЗ
	|		РегистрНакопления.РазметкаАУСН.Обороты(&НачалоПериода, &КонецПериода,, Организация = &Организация) КАК
	|			РазметкаАУСНОбороты
	|	ГДЕ
	|		РазметкаАУСНОбороты.ПризнакНалоговойБазы = &Приход
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		-РазметкаАУСНОбороты.СуммаОборот
	|	ИЗ
	|		РегистрНакопления.РазметкаАУСН.Обороты(&НачалоПериода, &КонецПериода,, Организация = &Организация) КАК
	|			РазметкаАУСНОбороты
	|	ГДЕ
	|		РазметкаАУСНОбороты.ПризнакНалоговойБазы = &ВозвратПрихода) КАК ВложенныйЗапрос";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция СуммаДоходовПоКассовымОперациям(Организация, НачалоПериода, КонецПериода)
	
	СчетаВыручки = БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.Выручка); // 90.01
	
	КорСчета = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КорСчета,
		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.КассаОрганизации)); // 50.01
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КорСчета,
		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.ПереводыВПути)); // 57.01
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КорСчета,
		БухгалтерскийУчетПовтИсп.СчетаВИерархии(ПланыСчетов.Хозрасчетный.РасчетыСРозничнымиПокупателями)); // 62.Р
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("СчетаВыручки", СчетаВыручки);
	Запрос.УстановитьПараметр("КорСчета", КорСчета);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотКт, 0) КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода,, Счет В (&СчетаВыручки),,
	|		Организация = &Организация, КорСчет В (&КорСчета),) КАК ХозрасчетныйОбороты";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Процедура РазместитьИнформациюОЗадачеСведенияПоСотрудникам(Форма, Срок)
	
	Элементы = Форма.Элементы;
	
	ГруппаБаннера = Элементы.Вставить("ГруппаПояснениеЗадачи", Тип("ГруппаФормы"), , Элементы.ОтчетТабличныйДокумент);
	ГруппаБаннера.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаБаннера.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаБаннера.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаБаннера.РастягиватьПоГоризонтали = Истина;
	ГруппаБаннера.РастягиватьПоВертикали = Ложь;
	ГруппаБаннера.ЦветФона = ЦветаСтиля.ЦветФонаПодсказки;
	ГруппаБаннера.ОтображатьЗаголовок = Ложь;
	ГруппаБаннера.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
	
	НадписьБаннера = Элементы.Добавить("ДекорацияПояснениеЗадачи", Тип("ДекорацияФормы"), ГруппаБаннера);
	НадписьБаннера.Вид = ВидДекорацииФормы.Надпись;
	НадписьБаннера.РастягиватьПоГоризонтали = Истина;
	НадписьБаннера.РастягиватьПоВертикали = Ложь;
	НадписьБаннера.АвтоМаксимальнаяШирина = Ложь;
	НадписьБаннера.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(СтрШаблон(
		НСтр("ru = 'Передайте в ФНС сведения о доходах, вычетах и суммах НДФЛ по каждому сотруднику.
			|Эти сведения требуется перенести из отчета в <a href=""%1"">личный кабинет плательщика АУСН</a> не позднее <b>%2</b>'"),
		УчетАУСНКлиентСервер.АдресЛичногоКабинетаПлательщикаАУСН(),
		Формат(Срок, "ДЛФ=DD;")));
	
КонецПроцедуры

Процедура НачислитьНалогАУСН(КонтекстРасчета, ТаблицаПроводок, Ошибки)
	
	СчетНачисленияНалога = ПланыСчетов.Хозрасчетный.НалогПриАУСН;         // Кт 68.15
	СчетОтраженияНалога  = ПланыСчетов.Хозрасчетный.ПрибылиИУбыткиНеЕНВД; // Дт 99.01.1
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",   КонтекстРасчета.Организация);
	Запрос.УстановитьПараметр("НачалоПериода",  КонтекстРасчета.НачалоНалоговогоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонтекстРасчета.КонецНалоговогоПериода);
	
	ПростойУчетЕНС = КонтекстРасчета.НачалоНалоговогоПериода >= ЕдиныйНалоговыйСчет.НачалоПростогоУчета();
	
	Если ПростойУчетЕНС Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетНалогаАУСН.Сумма КАК Сумма
		|ИЗ
		|	РегистрСведений.РасчетНалогаАУСН КАК РасчетНалогаАУСН
		|ГДЕ
		|	РасчетНалогаАУСН.Организация = &Организация
		|	И РасчетНалогаАУСН.НалоговыйПериод = &НачалоПериода";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РасчетыПоНалогамНаЕдиномНалоговомСчетеОбороты.СуммаПриход КАК Сумма
		|ИЗ
		|	РегистрНакопления.РасчетыПоНалогамНаЕдиномНалоговомСчете.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			СчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалогПриАУСН)
		|				И Организация = &Организация
		|				И ГоловнаяОрганизация = &Организация) КАК РасчетыПоНалогамНаЕдиномНалоговомСчетеОбороты";
	КонецЕсли;
	
	СуммаПоУчету = Запрос.Выполнить().Выбрать();
	
	Если СуммаПоУчету.Следующий() Тогда
		НалогКНачислению = СуммаПоУчету.Сумма;
	Иначе
		НалогКНачислению = 0;
	КонецЕсли;
	
	// Данные для проводки по начислению налога
	// (проводку формируем только при ненулевом налоге)
	Если НалогКНачислению <> 0 Тогда
		
		СтрокаПроводки = ТаблицаПроводок.Добавить();
		
		СтрокаПроводки.СчетДт                 = СчетОтраженияНалога;
		СтрокаПроводки.СчетКт                 = СчетНачисленияНалога;
		СтрокаПроводки.ПрибылиИУбытки         = Перечисления.ПрибылиИУбытки.НалогНаПрибыль;
		СтрокаПроводки.ВидыПлатежейВГосБюджет = Перечисления.ВидыПлатежейВГосБюджет.Налог;
		СтрокаПроводки.Сумма                  = НалогКНачислению;
		СтрокаПроводки.Содержание             = НСтр("ru = 'Отражен расход по налогу при АУСН'", ОбщегоНазначения.КодОсновногоЯзыка());
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПодготовитьПараметрыНачисленияНалогаАУСН(ТаблицаПроводок, ТаблицаРеквизитов)

	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.Реквизиты
	
	СписокОбязательныхКолонок = ""
		+ "Период,"      // <Дата> - период движений - дата документа
		+ "Регистратор," // <ДокументСсылка.РегламентнаяОперация> - документ-регистратор движений
		+ "Организация"; // <СправочникСсылка.Организации> - организация
		
	Реквизиты = ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизитов, СписокОбязательныхКолонок);
	Параметры.Вставить("Реквизиты", Реквизиты);
		
	// Подготовка таблицы Параметры.Проводки
	
	СписокОбязательныхКолонок = ""
		+ "СчетДт,"                 // <ПланСчетовСсылка.Хозрасчетный> - счет дебета
		+ "СчетКт,"                 // <ПланСчетовСсылка.Хозрасчетный> - счет кредита
		+ "ПрибылиИУбытки,"         // <ПеречислениеСсылка.ПрибылиИУбытки> - субконто счета дебета
		+ "ВидыПлатежейВГосБюджет," // <ПеречислениеСсылка.ВидыПлатежейВГосБюджет> - субконто кредита
		+ "Сумма,"                  // <Число, 15, 2> - сумма проводки
		+ "Содержание";             // <Строка, 150> - содержание проводки
		
	Проводки = ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаПроводок, СписокОбязательныхКолонок);
	Параметры.Вставить("Проводки", Проводки);
		
	Возврат Параметры;

КонецФункции

#КонецОбласти
